alibaba/AliOS-Things/components/py_engine/adapter/esp32/boards/M5STACK_CORE2/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ESP32 module (spiram)"
#define MICROPY_HW_MCU_NAME "ESP32"
#define MICROPY_HW_BOARD_TYPE "8M"
#define MICROPY_SW_VENDOR_NAME "HaaSPython"
